Public Attributes | List of all members
API_ElementMemo Struct Reference
Element Manager
Describes the variable length additional data of elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Coord **  | coords
Coordinate array (used for polygons, spline coordinates, etc.).
 Int32 **  | pends
Polygon endpoints; see API_Polygon for more information.
 API_PolyArc **  | parcs
Polygon arcs; see API_PolyArc and API_Polygon for more information.
 UInt32 **  | vertexIDs
Unique identifiers the polygon vertices (unique inside the polygon).
 UInt32 **  | edgeIDs
Unique identifiers the polygon edges (unique inside the polygon).
 UInt32 **  | contourIDs
Unique identifiers the polygon contours (unique inside the polygon).
 API_AddParType **  | params
Additional parameters for library part-based elements.
 API_Gable **  | gables
Parameters of the cutting planes the element has been cut with.
 API_EdgeTrim **  | edgeTrims
Trim data of slab/roof/shell edges. (Formerly roofSides.)
 double **  | meshPolyZ
Z coordinates of mesh polygon points.
 API_MeshLevelCoord **  | meshLevelCoords
Mesh level line coordinates.
 Int32 **  | meshLevelEnds
Mesh level line endpoints.
 API_DimElem **  | dimElems
Dimension elements.
 API_SplineDir **  | bezierDirs
Bezier-spline directions.
 char **  | textContent
Text content for textual elements.
 short **  | textLineStarts
Text line starts array (indices into the text content).
 API_Beam_Hole **  | beamHoles
Beam hole information.
 API_LinkType **  | linkList
Camera link list.
 char **  | pictHdl
Picture content.
 API_ParagraphType **  | paragraphs
Paragraph informations for text and label element.
 GSPtr  | drawingData
Internal format drawing data of an API_DrawingType element.
 ProfileVectorImage *  | customOrigProfile
The original custom profile data applied to the wall, beam, or column element, in HGX::VectorImage format (see API_ProfileAttrType).
 ProfileVectorImage *  | stretchedProfile
The stretched profile actually used by the wall, beam, or column element, in HGX::VectorImage format (see API_ProfileAttrType).
 GSPtr  | customParams
Reserved for internal use.
 API_SectionSegment *  | intElevSegments
Segments of an interior elevation.
 API_Coord *  | sectionSegmentMainCoords
Coordinates of the section/elevation/interior elevation main line.
 API_Coord *  | sectionSegmentDistCoords
Coordinates of the section/elevation/interior elevation marked distant area line.
 API_Coord *  | sectionSegmentDepthCoords
Coordinates of the section/elevation/interior elevation depth line.
 API_Guid *  | wallWindows
Guid list of Window elements in the specified Wall (output only).
 API_Guid *  | wallDoors
Guid list of Door elements in the specified Wall (output only).
 API_GridMesh *  | cWSegGridMesh
Curtain wall segment grid mesh.
 API_CWContourData *  | cWSegContour
The contour of Curtain Wall segments.
 API_CWSegmentPatternData  | cWSegPrimaryPattern
Curtain Wall primary segment pattern.
 API_CWSegmentPatternData  | cWSegSecondaryPattern
Curtain Wall secondary segment pattern.
 API_CWSegmentPatternCellData *  | cWSegPatternCells
Curtain Wall segment pattern cells.
 API_CWSegmentType *  | cWallSegments
Curtain Wall segments.
 API_CWFrameType *  | cWallFrames
Curtain Wall frame instances.
 API_CWFrameType *  | cWallFrameDefaults
Curtain Wall custom frame defaults (categories/classes).
 API_CWPanelType *  | cWallPanels
Curtain Wall panel instances.
 API_CWPanelGridIDTable *  | cWallPanelGridIDTable
This table contains the grid mesh identifiers for each Curtain Wall panel instance (these grid mesh cells are partly or fully covered by the panel).
 API_CWPanelType *  | cWallPanelDefaults
Curtain Wall panel defaults (categories/classes).
 API_CWJunctionType *  | cWallJunctions
Curtain Wall junction instances.
 API_CWAccessoryType *  | cWallAccessories
Curtain Wall accessory instances.
 API_StairRiserType *  | stairRisers
Stair Riser subelements.
 API_StairTreadType *  | stairTreads
Stair Tread subelements.
 API_StairStructureType *  | stairStructures
Stair Structure subelements.
 API_StairBoundaryData  | stairBoundary [2]
Stair boundaries (index 0 is the left, and 1 is the right).
 API_StairPolylineData  | stairBaseLine
The base line of a Stair element.
 API_StairPolylineData  | stairWalkingLine
The walking line of a Stair element.
 API_StairPolylineData  | stairCustomWalkLine
The customized walking line of a Stair element.
 API_StairPolylineData  | stairCenterWalkLine
The default, centered walking line of a Stair element.
 API_RailingNodeType *  | railingNodes
Railing Node subelements.
 API_RailingSegmentType *  | railingSegments
Railing Segment subelements.
 API_RailingPostType *  | railingPosts
Railing Post subelements.
 API_RailingRailEndType *  | railingRailEnds
Rail End subelements.
 API_RailingRailConnectionType *  | railingRailConnections
Rail Connection subelements.
 API_RailingRailEndType *  | railingHandrailEnds
Handrail End subelements. Only filled for Railing elements. If a Railing Node element is queried, these can be found inside the Element's structure.
 API_RailingRailConnectionType *  | railingHandrailConnections
Handrail Connection subelements. Only filled for Railing elements. If a Railing Node element is queried, these can be found inside the Element's structure.
 API_RailingRailEndType *  | railingToprailEnds
Toprail End subelements. Only filled for Railing elements. If a Railing Node element is queried, these can be found inside the Element's structure.
 API_RailingRailConnectionType *  | railingToprailConnections
Toprail Connection subelements. Only filled for Railing elements. If a Railing Node element is queried, these can be found inside the Element's structure.
 API_RailingRailType *  | railingRails
Rail subelements.
 API_RailingToprailType *  | railingToprails
Toprail subelements.
 API_RailingHandrailType *  | railingHandrails
Handrail subelements.
 API_RailingPatternType *  | railingPatterns
Railing Pattern subelements.
 API_RailingInnerPostType *  | railingInnerPosts
Inner Post subelements.
 API_RailingPanelType *  | railingPanels
Railing panel subelements.
 API_RailingBalusterSetType *  | railingBalusterSets
Baluster Set subelements.
 API_RailingBalusterType *  | railingBalusters
Baluster subelements.
 double **  | polyZCoords
Array for the Z coordinates of a coordinate array.
 API_RoofEdgeTypeID *  | roofEdgeTypes
Roof edge types.
 API_OverriddenAttribute *  | sideMaterials
Roof / Slab side materials.
 API_Coord **  | additionalPolyCoords
Coordinate array of the pivot polygon of a Multi-plane Roof element (see API_PolyRoofData) or the found polygon of the zone element. In case of zones, it can be nullptr if zone does not have found polygon. Also this is output only parameter for zones. Can be accessed with the APIMemoMask_AdditionalPolygon memo mask.
 Int32 **  | additionalPolyPends
Polygon endpoints of the pivot polygon of a Multi-plane Roof element (see API_PolyRoofData) or the found polygon of the zone element. Can be accessed with the APIMemoMask_AdditionalPolygon memo mask. See also API_Polygon for more information.
 API_PolyArc **  | additionalPolyParcs
Polygon arcs of the pivot polygon of a Multi-plane Roof element (see API_PolyRoofData) or the found polygon of the zone element. Can be accessed with the APIMemoMask_AdditionalPolygon memo mask. See also API_PolyArc and API_Polygon for more information.
 UInt32 **  | additionalPolyVertexIDs
Unique identifiers the polygon vertices of the pivot polygon of a Multi-plane Roof element (see API_PolyRoofData). Not used for zones. Can be accessed with the APIMemoMask_AdditionalPolygon memo mask.
 UInt32 **  | additionalPolyEdgeIDs
Unique identifiers the polygon edges of the pivot polygon of a Multi-plane Roof element (see API_PolyRoofData). Not used for zones. Can be accessed with the APIMemoMask_AdditionalPolygon memo mask.
 UInt32 **  | additionalPolyContourIDs
Unique identifiers the polygon contours of the pivot polygon of a Multi-plane Roof element (see API_PolyRoofData). Not used for zones. Can be accessed with the APIMemoMask_AdditionalPolygon memo mask.
 API_PivotPolyEdgeData *  | pivotPolyEdges
Multi-plane roof specific data associated to the edges of the pivot polygon. They contain geometry (angle, eavesOverHang) and attribute (material etc.) data for each segment (see API_PivotPolyEdgeData). Can be accessed with the APIMemoMask_PivotPolygon memo mask.
 API_ShellShapeData  | shellShapes [2]
Shell specific data to describe the profiles that form the shell shape. Extruded and revolved shells use the first (0-indexed) record only, ruled shells use both. This is a required parameter to pass when creating a new shell element.
 API_ShellContourData *  | shellContours
Shell specific data to define body contour and hole contours to the shell element. If hasContour is true, the first record contains the body contour data. If the shell has holes (numHoles > 0), the following items of the array describe the hole contours (the first hole contour is located in the second (1-indexed) record if there is a body contour given, otherwise it is in the first (0-indexed) record).
 Modeler::MeshBody *  | morphBody
Morph element.
 API_OverriddenAttribute *  | morphMaterialMapTable
Morph element.
 GS::UniString *  | elemInfoString
Info string of the element.
 API_BeamSegmentType *  | beamSegments
Beam segments.
 API_ColumnSegmentType *  | columnSegments
Column segments.
 API_AssemblySegmentCutData *  | assemblySegmentCuts
Cuts of segments.
 API_AssemblySegmentSchemeData *  | assemblySegmentSchemes
Segment schemes.
 API_AssemblySegmentProfileData *  | assemblySegmentProfiles
Segment profiles.
 GS::Any *  | externalElemData
External element data.
Detailed Description
Describes the variable length additional data of elements.
Remarks
See ACAPI_Element_GetMemo to find out which element type needs/provides which information in the memo. If you retrieve an array of vertices, edges or contours with ACAPI_Element_GetMemo, do not change the IDs in these arrays. New vertices, edges and contours should be inserted with ID = 0.